Repository: bit-part/craftcms_docs-ja
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: ja

source: Each entry has an Author, a Post Date, an Expiration Date (if desired), a status (enabled or disabled), and of course, content.
ja: すべてのエントリは投稿者、投稿日、（もし望むなら）有効期限日、（有効・無効の）ステータスと、もちろん、コンテンツを持っています。

source: Each of these types allows you to store your content with a slightly different set of features.
ja: それぞれのセクションタイプには、わずかに異なる機能とともにコンテンツを保存しておくことができます。

source: Each of your asset volumes has a field layout, where you can attach fields that will be available to any assets within that volume.
ja: それぞれのアセットボリュームはフィールドレイアウトを持っていて、そのボリュームに含まれるすべてのアセットが利用可能なフィールドを付加できます。

source: Each of your site’s global sets will be available to your template as global variables, named after their handle.
ja: それそれのサイトのグローバル設定は、ハンドルにちなんで命名されたグローバル変数としてテンプレートで利用可能です。

source: Each relation involves two elements:
ja: それぞれのリレーションは2つのエレメントを必要とします。

source: Each row is a sub-array which holds each of the columns’ values for that row.
ja: それぞれの行は、その行の列ごとの値を保持するサブ配列です。

source: Each site has a Base URL, which Craft uses as the starting point when generating dynamic links to entries and other site content.
ja: すべてのサイトはベース URL を持っていて、Craft がエントリや他のサイトコンテンツの動的なリンクを生成する際に出発点として使用します。

source: Each site has the following attributes:
ja: それぞれのサイトは、次の属性を持っています。

source: Each tag group holds a unique set of tags, and lets you define a custom set of fields that should be available to tags within the group.
ja: それぞれのタググループには、ユニークなタグのセットがあり、グループ内のタグが利用可能な独自のフィールドのセットを定義できます。

source: Each transform has the following settings:
ja: トランスフォームには、次の設定があります。

source: Each update its own Update button.
ja: それぞれのアップデートは、それ自身の「アップデート」ボタンを利用します。

source: Eager-Loading Elements
ja: エレメントの Eager-Loading

source: Eager-Loading Elements Related to Matrix Blocks
ja: 行列ブロックに関連するエレメントの Eager-Loading

source: Eager-Loading Image Transform Indexes
ja: イメージ変換インデックスの Eager-Loading

source: Eager-Loading Multiple Sets of Elements
ja: エレメントの複数セットの Eager-Loading

source: Eager-Loading Nested Sets of Elements
ja: エレメントのネストされたセットの Eager-Loading

source: Edit [Category Group Name]
ja: 「カテゴリグループ名」 を編集する

source: Edit [Global Set Name]
ja: 「グローバル設定名」 を編集する

source: Edit [Locale Name]
ja: 「サイト名」 を編集する

source: Edit [Site Name]
ja: 「サイト名」 を編集する

source: Edit an image using the built-in image editor
ja: 組み込みのイメージエディタを利用した、画像の編集

source: Edit entries
ja: エントリを編集する

source: Edit files’ titles and filename
ja: ファイルのタイトルやファイル名の編集

source: Edit the entry’s custom field content
ja: エントリのカスタムフィールドコンテンツの編集

source: Edit the entry’s slug
ja: エントリのスラグの編集

source: Edit the entry’s title
ja: エントリのタイトルの編集

source: Edit the slug (it's automatically populated based on the title).
ja: スラグの編集（タイトルに基づいて、自動的に入力されます）

source: Edit users
ja: ユーザーを編集する

source: Editing Asset Content
ja: アセットコンテンツの編集

source: Editing Entries
ja: エントリの編集

source: Editing Entry Content
ja: エントリコンテンツの編集

source: Editing Entry Form
ja: エントリの編集フォーム

source: Editing Tag Content
ja: タグコンテンツの編集

source: Element Action Types
ja: エレメントアクションタイプ

source: Element Queries
ja: エレメントクエリ

source: Element Type
ja: エレメントタイプ

source: Element Types
ja: エレメントタイプ

source: Element criteria
ja: エレメントの判定基準

source: Element queries are query builders that are tuned for fetching elements in Craft.
ja: エレメントクエリは、Craft でエレメントを取得するためにチューニングされたクエリビルダーです。

source: Elements
ja: エレメント

source: Email Fields
ja: Email フィールド

source: Enable the “Assets in this volume have public URLs” setting
ja: 「このボリュームのアセットにはパブリック URL が含まれます」設定を有効化します。

source: Encrypts and base64-encodes a string.
ja: 文字列を暗号化し、base64 エンコードします。

source: Enter yes at the prompt, and a new migration file will be created in a migrations/ folder in your project root.
ja: プロンプトで yes と入力すると、新しいマイグレーションファイルがプロジェクトルートの migrations/ フォルダに作成されます。

source: Enter content migrations.
ja: コンテンツマイグレーションをはじめてください。

source: Entries
ja: エントリ

source: Entries Fields
ja: エントリフィールド

source: Entries are your individual pieces of content (like a cocktail recipe).
ja: エントリは（カクテルレシピのような）コンテンツの独立したピースです。

source: Entries fields allow you to relate entries to the parent element.
ja: エントリフィールドでは、エントリを親エレメントに関連付けることができます。

source: Entries fields have the following settings:
ja: エントリフィールドの設定は、次の通りです。

source: Entries fields list all of the currently selected entries, with a button to select new ones:
ja: エントリフィールドには、現在選択されているすべてのエントリのリストと、新しいエントリを追加するためのボタンがあります。

source: Entries hold the content that you want to display on your web pages.
ja: エントリはウェブページに表示させたいコンテンツを保持します。

source: Entries support the following custom identifiers:
ja: エントリは次のカスタム識別子をサポートしています。

source: Entries use the field layout defined by their entry type in Settings → Sections → Edit Entry Types → → Field Layout.
ja: エントリは、「設定 > セクション > 入力タイプ > 入力タイプ名 > フィールドレイアウト」の入力タイプごとに定義されたフィールドレイアウトを使用します。

source: Entry Form
ja: エントリの投稿フォーム

source: Entry Queries
ja: エントリクエリ

source: Entry Query Params
ja: エントリのクエリパラメータ

source: Entry Type Edit Settings
ja: 入力タイプの設定編集画面

source: Entry Types
ja: 入力タイプ

source: Entry URI Formats
ja: エントリー URI 形式

source: Entry URI Formats are mini Twig templates, which will be rendered each time an entry in the section is saved.
ja: エントリー URI 形式は、セクション内のエントリが保存されるごとにレンダリングされる小さな Twig テンプレートです。

source: Entry types have the following settings:
ja: 入力タイプの設定は、次の通りです。

source: Entry
ja: エントリ

source: Every Craft installation starts with one default site.
ja: Craft のインストールは、1つのデフォルトサイトから始まります。

source: Every single template is going to get loaded with the following variables:
ja: ありとあらゆるテンプレートでは、次の変数を読み込むことができます。

source: Everything in Craft that has content associated with it will provide a field layout for selecting fields:
ja: 関連するコンテンツを持つ Craft 内のすべての場所で、フィールドを選択するためのフィールドレイアウトを提供します。

source: Everything within the Settings section
ja: 設定セクションに含まれるすべてのこと

source: Examples
ja: 実例

source: Examples include:
ja: 例として次のものを含みます。

source: Exclusionary gendered language (guys, gentlemen, bros, etc).
ja: 排他的な性差を表す言葉（guys、gentlemen、bros など）。

source: Executing Element Queries
ja: エレメントクエリの実行

source: Executing Migrations
ja: マイグレーションの実行

source: Extending Twig
ja: Twig 拡張

source: Extract the archive wherever you want your new Craft project to live.
ja: 新しい Craft プロジェクトを稼働したい場所でアーカイブを展開します。

source: Feel free to delete this file, or replace its contents with something more relevant to your project.
ja: このファイルを削除するか、プロジェクトに関連性の高いコンテンツに置き換えてください。

source: Feel free to delete this file.
ja: このファイルは、自由に削除してください。

source: Field Layouts
ja: フィールドレイアウト

source: Field Settings
ja: フィールドの設定画面

source: Field Types
ja: フィールドタイプ

source: Field layouts for entry types have another feature:
ja: 入力タイプのフィールドレイアウトは、異なる特徴があります。

source: Field layouts for entry types have another feature: they let you define the
ja: 入力タイプのフィールドレイアウトは、異なる機能があります。

source: Field layouts for entry types have another feature: they let you define the content tabs that contain the fields.
ja: 入力タイプのフィールドレイアウトには別の機能があり、フィールドを含むコンテンツタブを定義できます。

source: Fields
ja: フィールド

source: Fields are defined globally from Settings → Fields.
ja: フィールドは「設定 > フィールド」からグローバルに定義されます。

source: File
ja: ファイル

source: Fill out the Entry URI Format (for Channel and Structure sections) or URI (for Single sections) to reflect how you want the URIs structured for that site.
ja: そのサイトをどのような URL 構造にしたいかを反映するため、（チャンネルとストラクチャーセクション向けに）エントリー URI 形式、または（シングルセクション向けに）URI を記入します。

source: Fill out the category fields (if you didn't define any then the only field available will be Title)
ja: カテゴリフィールドへの記入（フィールドを定義していなければ、タイトルフィールドだけが利用可能となります）

source: Filtering by block type
ja: ブロックタイプのフィルタリング

source: Filters
ja: フィルタ

source: Filters that come with Twig
ja: Twig に付随するフィルタ

source: Finally, Craft will check if the URI is a valid template path.
ja: 最後に、Craft はその URI が有効なテンプレートパスかどうかをチェックします。

source: Finally, it’s time to run Craft’s Setup Wizard.
ja: ついに、Craft のセットアップウィザードを実行するときがきました。

source: Firefox 28 or later
ja: Firefox 28 以降

source: First generate a cryptographically secure key, preferably using a password generator like 1Password.
ja: はじめに、なるべく 1Password のようなパスワードジェネレーターを使って、暗号化された安全なキーを生成してください。

source: First, make sure your tag has an enctype="multipart/form-data" attribute, so that it is capable of uploading files.
ja: まず、 タグに enctype="multipart/form-data" 属性があることを確認して、ファイルをアップロードできるようにします。

source: First, you must create an object that defines the transform’s parameters:
ja: はじめに、トランスフォームのパラメータを定義したオブジェクトを作成する必要があります。

source: First/Last Page Links
ja: 最初 / 最後のページリンク

source: Fit
ja: フィット

source: Focus on readability.
ja: 可読性に焦点を当てましょう。

source: Follow Composer’s instructions to install it:
ja: 次の Composer のガイドに従いインストールしてください。

source: Follow steps 1 and 2 from the Installation Instructions.
ja: インストールガイドのステップ1からステップ2に従ってください。

source: Follow the PSR-1 & PSR-2 coding standards.
ja: PSR-1 と PSR-2 のコーディング基準に従ってください。

source: Following your {% paginate %} tag, you will need to loop through this page’s elements using a for tag.
ja: {% paginate %} タグに続けて、for タグを使用することでこのページのエレメントをループする必要があります。

source: For Craft to run properly, PHP needs to be able to write to the following places:
ja: Craft が正しく動作するためには、PHP が次の場所への書き込み権限が必要です。

source: For additional Global Set properties you can ise besides your custom fields see for a full reference.
ja: カスタムフィールド以外で利用できる追加のグローバル設定のプロパティについては、リファレンスの を参照してください。

source: For additional Global Set properties you can ise besides your custom fields see craft\elements\GlobalSet for a full reference.
ja: カスフィールド以外で利用できる追加のグローバル設定のプロパティについては、リファレンスの craft\elements\GlobalSet を参照してください。

source: For each transform, Craft needs to execute a query to see if the transform already exists.
ja: それぞれのトランスフォームに対して、Craft が既に変換された画像が存在するか確認するためにクエリを実行する必要があります。

source: For example you could set it to 'page/', and your paginated URLs would start looking like http://example.com/news/page/2.
ja: 例えば、'page/' をセットすると、ページ付けされた URL は http://example.com/news/page/2 のようになります。

source: For example, {% exit 404 %} will get Craft to return the 404.html template.
ja: 例えば、{% exit 404 %} は Craft に 404.html テンプレートを返します。

source: For example, pixelandtonic/craft-recipes.
ja: 例えば pixelandtonic/craft-recipes のような形です。

source: For example, here’s a template that loops through a list of entries, and displays images related by an Assets field for each entry:
ja: 例えば、ここにエントリのリストをループし、それぞれのエントリに関連付けられた画像を表示するテンプレートがあります。

source: For example, if you have a template located at craft/templates/recipes/entry.html, the following template paths would point to it:
ja: 例えば、craft/templates/recipes/entry.html にテンプレートがある場合、次のテンプレートパスで指し示すことができます。

source: For example, if you have a template located at craft/templates/recipes/ingredients/index.html, the following template paths would point to it:
ja: 例えば、craft/templates/recipes/ingredients/index.html にテンプレートがある場合、次のテンプレートパスで指し示すことができます。

source: For example, if you intend to use the field with entries, then you can use any properties listed in the documentation, such as {id}, {slug}, or even nested object properties like {author.username}.
ja: 例えば、エントリフィールドを利用したい場合、{id} や {slug}、または {author.username} のようなネストされたオブジェクトのプロパティなど、 ドキュメントに記載されているすべてのプロパティを利用できます。

source: For example, if you intend to use the field with entries, then you can use any properties listed in the craft\elements\entries documentation, such as {id}, {slug}, or even nested object properties like {author.username}.
ja: 例えば、エントリフィールドを利用したい場合、{id} や {slug}、または {author.username} のようなネストされたオブジェクトのプロパティなど、craft\elements\entries ドキュメントに記載されているすべてのプロパティを利用できます。

source: For example, if you want to create a special template welcoming your German customers, but there’s no need for it on your English site, then you could save it in craft/templates/de/welcome.html.
ja: 例えば、ドイツのカスタマーを歓迎するための特別なテンプレートを作成したいものの、英語版サイトで必要ない場合、craft/templates/de/welcome.html に保存します。

source: For example, if you wanted to give your German site its own homepage template, you might set your templates folder up like this:
ja: 例えば、ドイツ語のサイトのホームページを独自のテンプレートにする場合、テンプレートフォルダを次のように設定します。

source: For example, outputting all of the current user’s favorite drinks that include espresso:
ja: 例えば、エスプレッソを含む現在のユーザーのお気に入りの飲み物をすべて出力するには、次のようになります。

source: For example, the following code would return a 301 redirect (permanent):
ja: 例えば、次のコードは 301 リダイレクト（永続的）を返します。

source: For example, this would output the source element’s slug if it has one, otherwise its ID:
ja: 例えば、これはソースエレメントにスラグがあればそれを、そうでなければ ID を出力することができます。

source: For example, with this route:
ja: 例として、次のルートがあるとします。

source: For example, you may wish to create aliases that define the base URL and base path that your asset volumes will live in.
ja: 例えば、アセットボリュームが存在するベース URL とベースパスを定義するエイリアスを作成したいかもしれません。

source: For example:
ja: 例えば、

source: For more depth on each piece, click through to the Core Concepts section of the documentation.
ja: 各項目の詳細は、ドキュメントのコアコンセプトのセクションをクリックしてください。

source: For more information on the technical requirements of Craft, see the Requirements section.
ja: Craft の技術要件に関するより詳しい情報は必須要件のセクションを見てください。

source: For our example it'll be https://beta.craftcms.com.
ja: この例では https://beta.craftcms.com になります。

source: For projects that require upgrading a current Craft 2 project to Craft 3, review the Craft 2 Upgrade documentation.
ja: 既存の Craft 2 プロジェクトを Craft 3 にアップグレードする必要がある場合、Craft 2 アップグレードドキュメントを再確認してください。

source: For the curious, here are the types of things you will find in storage/runtime/ (though this is not a comprehensive list):
ja: 興味がある方のために、（包括的なリストではありませんが）storage/runtime/ で確認できるものを掲載します。

source: For the curious, here are the types of things you will find in craft/storage/runtime (though this is not a comprehensive list):
ja: 興味がある方のために、（包括的なリストではありませんが）craft/storage/runtime で確認できるものを掲載します。

source: Forgot Password Form
ja: パスワードを忘れた際のフォーム

source: Formats a date as a human-readable timestamp, via <craft\i18n\Formatter::asTimestamp()>.
ja: <craft\i18n\Formatter::asTimestamp()> 経由で、人が読めるタイムスタンプとして日付をフォーマットします。

source: Formats a date as a human-readable timestamp, via craft\i18n\Formatter::asTimestamp().
ja: craft\i18n\Formatter::asTimestamp() 経由で、人が読めるタイムスタンプとして日付をフォーマットします。

source: Formats a number according to the user’s preferred language.
ja: ユーザーが優先する言語に応じて、数値をフォーマットします。

source: Formats a number of bytes into something nicer.
ja: バイト数をより良い何かにフォーマットします。

source: Formats a number with a given currency according to the user’s preferred language.
ja: ユーザーが優先する言語に応じて指定された通貨で、数値をフォーマットします。

source: Formats a percentage according to the user’s preferred language.
ja: ユーザーが優先する言語に応じて、割合をフォーマットします。

source: Formats a string into something that will work well as an HTML input id, via .
ja: を経由して、HTML の input 要素の id としてうまく動作するよう、文字列をフォーマットします。

source: Formats a string into something that will work well as an HTML input id, via craft\web\View::formatInputId().
ja: craft\web\View::formatInputId() を経由して、HTML の input 要素の id としてうまく動作するよう、文字列をフォーマットします。

source: From there you can choose a category group from the sidebar, and add/reorder/delete categories within it:
ja: サイドバーからカテゴリグループを選択すると、そのグループに含まれるカテゴリを追加・並び替え・削除できます。

source: From there you can navigate to the entry you wish to edit, or create a new one.
ja: そこから、編集したいエントリに移動したり、新しいエントリを作成できます。

source: From this page, you can do the following:
ja: このページでは、次のことができます。

source: Functions
ja: ファンクション

source: Functions that come with Twig
ja: Twig に付随するファンクション

source: GD or ImageMagick.
ja: GD または ImageMagick。

source: General Config
ja: 一般設定

source: General Tech Specs
ja: 技術仕様

source: Getting Started
ja: はじめよう

source: Getting Target Elements via the Source Element
ja: ソースエレメントを経由したターゲットエレメントの取得

source: Getting the total number of blocks
ja: ブロックの総数の取得

source: Give your site a name.
ja: 名前を付けてください。

source: Global Set Variables
ja: グローバル設定の変数

source: Global Sets in Templates
ja: テンプレートでのグローバル設定

source: Global Sets with Multiple Sites
ja: マルチサイトでのグローバル設定

source: Global Variables
ja: グローバル変数

source: Global sets each get their own field layout, defined in Settings → Globals → → Field Layout.
ja: グローバル設定は、「設定 > グローバル > グローバル設定名 > フィールドレイアウト」で定義されたそれぞれのフィールドレイアウトを使用します。

source: GlobalSet
ja: グローバル設定

source: Globals
ja: グローバル

source: Globals store content that is available globally throughout your templates.
ja: グローバルは、テンプレート全体で包括的に利用可能なコンテンツを格納できます。

source: Go ahead and click Finish Up to update your database.
ja: 「Finish up（完了）」ボタンをクリックしてデータベースを更新してください。

source: Go ahead and click “Finish up” to update your database.
ja: 「Finish up（完了）」ボタンをクリックしてデータベースを更新してください。

source: Go into each Section that you want to be available in the new site and enable the site using the Site Settings table.
ja: 新しいサイトで有効にしたいセクションに移動し、「サイト設定」テーブルを利用してサイトを有効にします。

source: Go to Settings → Assets → Volumes → User Photos and configure the volume based on the new folder location:
ja: 「設定 > アセット > ボリューム > User Photos」に移動し、新しいフォルダのロケーションに基づいてボリュームを設定します。

source: Go to Settings → Sites and click the New Site button.
ja: 「設定 > サイト」に移動し、「新しいサイト」ボタンをクリックします。

source: Going Through Matrix
ja: 行列を経由する

source: Group
ja: グループ

source: Groups the items of an array together based on common properties.
ja: 共通のプロパティに基づいて、配列の項目をグループ化します。

source: Guide: Setting Up a Localized Site
ja: ガイド：ローカライズされたサイトの設定

source: Guide: Setting Up a New Site
ja: ガイド：新しいサイトの設定

source: Guzzle Config
ja: Guzzle 設定

source: Handle
ja: ハンドル

source: Handle – the transform’s template-facing handle
ja: ハンドル – テンプレートに対する画像変形のハンドル

source: Handle – How you’ll refer to this column from your templates
ja: ハンドル – テンプレートから、この列を参照する方法

source: Handle – The entry type’s template-facing handle
ja: ハンドル – 入力タイプのテンプレートに対応するハンドル

source: Harassment and other exclusionary behavior aren’t acceptable.
ja: いやがらせや排他的な行動は、容認できません。

source: Header
ja: ヘッダー

source: Height – the transform’s resulting height
ja: 高さ – 変換結果の高さ

source: Here .type() is applying the type parameter to a clone of query, so it had no effect on query.total(), which will still return the total number of News entries, regardless of their entry types.
ja: この .type() は type パラメータを query の clone に適用しているため、 query.total() には影響を与えません。入力タイプに関わらず、News エントリの総数を返します。

source: Here are a couple common examples of cache storage configurations:
ja: キャッシュストレージ設定の一般的な例です。

source: Here are a couple tips:
ja: ここにいくつかのヒントがあります。

source: Here are a few common examples.
ja: ここにいつくかの一般的な例があります。

source: Here are some additional resources for getting Craft installed in various environments:
ja: Craft をさまざまな環境にインストールするための追加リソースです。

source: Here are some examples of when to use them:
ja: それらを使用する場合のいくつかの例です。

source: Here are the lists of parameters supported by Craft’s built-in element types:
ja: Craft の組み込みエレメントタイプでサポートされているパラメータの一覧は、次の通りです。

source: Here is how Craft handles each request:
ja: Craft はリクエストを次のように処理します。

source: Here’s a full list of the properties that can go in that extra object:
ja: extra オブジェクトにセットできるプロパティの完全なリストは、次の通りです。

source: Here’s a list of things you used to be able to do in your templates, and what the Craft 3 equivalent is.
ja: ここに、テンプレート内で使用可能だったものと、Craft 3 で同様の働きをするもののリストを掲載します。

source: Here’s a rundown of the core concepts in Twig, the templating engine used by Craft.
ja: これは Craft のテンプレートエンジンである Twig のコアコンセプトの要約です。

source: Here’s an example of what the template might look like for a Matrix field with four Block Types (Heading, Text, Image, and Quote).
ja: 次に、4つのブロックタイプ（見出し、テキスト、画像、および引用）を持つ行列フィールドのテンプレートの実例を示します。

source: Here’s how to apply the with param to our example:
ja: 先の例に with パラメータを適用する方法は、次の通りです。

source: Here’s how you can resolve this:
ja: 次の方法で解決してください。

source: Here’s how:
ja: 次の通りです。

source: Here’s what they get set to:
ja: ここで設定されることは、次の通りです。

source: Hidden Templates
ja: 不可視テンプレート

source: Holds all of your Craft and plugin configuration files, as well as your license.key file.
ja: すべての Craft とプラグインの設定ファイルと license.key ファイルを保持します。

source: Holds any Yii modules your site might be using.
ja: サイトで使用している Yii modules を保持します。

source: How does this look in practice?
ja: これは実際にどのように見えるのでしょう？

source: How to Use the Documentation
ja: このドキュメントの使い方

source: How to sort the query results
ja: クエリ結果をどのようにソートするか

source: How you use the documentation will depend on your experience and situation.
ja: どのようにドキュメンテーションを使うかは、あなたの経験と状況に依存するでしょう。

source: However this folder is above your web root and inaccessible to HTTP requests, so until you make this volume publicly accessible, user photos will not work on the front end.
ja: しかしながら、このフォルダはウェブルートよりも上位階層にあるため、HTTP リクエストでアクセスできません。 そのため、このボリュームをアクセスできる状態にするまで、ユーサーフォトはフロントエンドで動作しません。

source: However when the assets are eager-loaded, entry.assetsField gets overwritten with an array of the eager-loaded assets.
ja: しかしながら、アセットを eager-loaded している 場合、entry.assetsField は eager-loaded されたアセットの配列で上書きされます。

source: However, you can set the values in those sets on a per site basis, even leaving some fields blank, if desired.
ja: しかしながら、必要に応じていくつかのフィールドを空のままにするなど、それぞれの設定値をサイトごとにセットできます。

source: However, you don't need to assign any fields to the Tag Group Field Layout in order to use the group.
ja: しかしながら、そのグループを利用するために、必ずしもタググループのフィールドレイアウトでフィールドを割り当てる必要はありません。

source: I get the Craft installer when I access my Control Panel.
ja: コントロールパネルにアクセスすると Craft のインストーラーが表示されます。

source: I'm Just Getting Started With Craft
ja: Craft を初めて使う方

source: I'm Moving from Craft 2 to Craft 3
ja: Craft 2 から Craft 3 へ移行する方

source: If Mode is set to “Crop”, an additional “Crop Position” setting will appear, where you can define which area of the image should be treated as the focal point when cropping.
ja: モード に「切り抜き」がセットされている場合、切り抜く際に画像のどのエリアを焦点として扱うかを定義できる「デフォルトの焦点」 プルダウンが表示されます。

source: If mode is set to 'crop', you can pass a position property, set to either 'top-left', 'top-center', 'top-right', 'center-left', 'center-center', 'center-right', 'bottom-left', 'bottom-center', or 'bottom-right'.
ja: mode に 'crop' をセットした場合、position プロパティに 'top-left'、'top-center'、 'top-right'、'center-left'、'center-center'、'center-right'、'bottom-left'、'bottom-center'、または 'bottom-right' のいずれかをセットして渡すことができます。

source: If true is passed, the formatted date will be run through before being returned.
ja: true を渡した場合、値を返す前にフォーマットされた日付へ が実行されます。

source: If true is passed, the formatted date will be run through craft\helpers\DateTimeHelper::translateDate() before being returned.
ja: true を渡した場合、値を返す前にフォーマットされた日付へ craft\helpers\DateTimeHelper::translateDate() が実行されます。

source: If Craft finds any of these in your Title Format, it will replace the { with {{object. and the } with }}, before passing the template off to Twig for parsing.
ja: Craft がタイトル形式の中でショートカット構文を見つけた場合、Twig の解析にあたりテンプレートへ渡す前に { を {{object. 、} を }} に置換します。

source: If Craft’s Setup Wizard is shown, the host name is correctly resolving to your Craft installation.
ja: Craft のセットアップウィザードが表示された場合、そのホスト名は Craft のインストールのために適切に処理されています。

source: If a field doesn't yet exist, you must first create it via Settings → Fields.
ja: まだフィールドが存在しなければ、先に「設定 > フィールド」から作成しなければなりません。

source: If a template is looping through a list of elements, and each of those elements must display one or more sub-elements, there’s a good chance the page’s performance will suffer.
ja: テンプレートがエレメントのリストをループしていて、それらのエレメントそれぞれで1つ以上のサブエレメントを表示しなければならない場合、ページのパフォーマンスが低下する高い可能性があります。

source: If an exact match is not found, the first option in the menu will actually create a new tag with the title that you typed in.
ja: 完全に一致するものが見つからない場合、メニューの最初のオプションからあなたが入力したタイトルの新しいタグを作成できます。

source: If checked, Craft will create a new entry in every site in the system.
ja: チェックした場合、Craft はシステム内のすべてのサイトに新しいエントリを作成します。

source: If it can’t determine that (probably because ImageMagik isn’t installed), it will just go with .jpg.
ja: （おそらく、ImageMagik がインストールされていないために）それを決定できない場合は、.jpg として処理されます。

source: If it is, Craft will return the matched template.
ja: そうであれば、Craft はマッチしたテンプレートを返します。
